START_MESSAGE = """🌿 Вітаємо в MykolaivGreenCare!
                 
Тут ти знайдеш все для:
🌱 догляду за рослинами (добрива, ґрунти, засоби)
🐾 улюбленців (корм, повідки, аксесуари)
                 
🛒 Обирай товари, отримуй поради та замовляй прямо в боті
                 
Натисни кнопку нижче, щоб почати 👇"""


UNKNOWN_MESSAGE = """🤔 Я не зрозумів цю команду.\n\n Скористайся меню нижче або введи /help"""


ADMIN_HELP = (
        "\n\n━━━━━━━━━━━━━━━━\n"
        "🔧 *Адмін-панель*\n\n"
        "/admin — відкрити панель керування\n\n"
        "📦 *Товари*\n"
        "/addproduct — додати новий товар\n"
        "/editproduct — відредагувати товар\n"
        "/removeproduct — прибрати товар\n\n"
        "📊 *Статистика*\n"
        "/stats — продажі та популярні товари"
    )

USER_HELP = (
        "🌿🐾 *Магазин товарів для рослин та тварин*\n\n"
        "Ось що я вмію:\n\n"
        "📋 *Каталог*\n"
        "/catalog — переглянути всі товари по категоріях\n\n"
        "🛒 *Корзина*\n"
        "/cart — переглянути та редагувати корзину\n\n"
        "📦 *Замовлення*\n"
        "/orders — історія твоїх замовлень\n\n"
        "👤 *Контактна інформація*\n"
        "/info — Додати/переглянути контактну інформацію\n\n"
        "💬 Якщо щось не працює — напиши нам: @FadeDragonn"
    )

CATALOG_OPEN = ( "🌿🐾 Оберіть категорію товарів:\n\n"
"🐾 Тварини — переглянути товари для тварин\n\n"
"🌿 Рослини — переглянути товари для рослин\n\n"
                 )


def info_message(user) -> str:
    name    = f"{user.first_name or ''} {user.last_name or ''}".strip() or "не вказано"
    phone   = user.phone   or "не вказано"
    email   = user.email   or "не вказано"
    address = user.address or "не вказано"
    return (
        "📌 *Інформація про магазин*\n"
        "🏪 Назва: Mykolaiv Green Care\n"
        "📍 Адреса: м. Миколаїв, вул. ______\n"
        "📞 Телефон: +380XXXXXXXXX\n"
        "📧 Email: mykolaivgreencare@gmail.com\n\n"
        "👤 *Ваші дані*\n"
        f"🙍 Ім'я: {name}\n"
        f"📱 Телефон: {phone}\n"
        f"📧 Email: {email}\n"
        f"🏠 Адреса: {address}\n\n"
        "✏️ Змінити:"
    )